## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                   |
|--------|-------------------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.karpenter-replicas-unavailable[0]`         |
|        | `aws_cloudwatch_query_definition.admin-api-50X-errors[0]`               |
|        | `aws_cloudwatch_query_definition.bounce-rate-critical[0]`               |
|        | `aws_cloudwatch_query_definition.bounce-rate-warning[0]`                |
|        | `aws_cloudwatch_query_definition.bounce-rate-warnings-and-criticals[0]` |
|        | `aws_cloudwatch_query_definition.celery-errors[0]`                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.karpenter-replicas-unavailable[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "karpenter-replicas-unavailable" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Karpenter Replicas Unavailable"
      + alarm_name                            = "karpenter-replicas-unavailable"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "m1"
          + return_data = true

          + metric {
              + dimensions  = {
                  + "ClusterName" = "notification-canada-ca-staging-eks-cluster"
                  + "deployment"  = "karpenter"
                  + "namespace"   = "karpenter"
                }
              + metric_name = "kube_deployment_status_replicas_unavailable"
              + namespace   = "ContainerInsights/Prometheus"
              + period      = 300
              + stat        = "Minimum"
            }
        }
    }

  # aws_cloudwatch_query_definition.admin-api-50X-errors[0] will be created
  + resource "aws_cloudwatch_query_definition" "admin-api-50X-errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application",
        ]
      + name                = "ADMIN & API - 50X errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /admin|api/
            | filter @message like /HTTP\/\d+\.\d+\\" 50\d/
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_cloudwatch_query_definition.bounce-rate-critical[0] will be created
  + resource "aws_cloudwatch_query_definition" "bounce-rate-critical" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application",
        ]
      + name                = "Critical bounces"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /admin|api/
            | filter @message like "critical bounce rate threshold of 10"
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_cloudwatch_query_definition.bounce-rate-warning[0] will be created
  + resource "aws_cloudwatch_query_definition" "bounce-rate-warning" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application",
        ]
      + name                = "Warning bounces"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /admin|api/
            | filter @message like "warning bounce rate threshold of 5"
            | sort @timestamp desc
            | limit 20
        EOT
    }

  # aws_cloudwatch_query_definition.bounce-rate-warnings-and-criticals[0] will be created
  + resource "aws_cloudwatch_query_definition" "bounce-rate-warnings-and-criticals" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application",
        ]
      + name                = "Bounce warnings and criticals grouped by type"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @service_id, @bounce_type
            | filter kubernetes.container_name like /^celery/
            | filter @message like /bounce rate threshold of/
            | parse @message "Service: * has met or exceeded a * bounce rate" as @service_id, @bounce_type
            | stats count(*) by @service_id, @bounce_type
            | limit 100
        EOT
    }

  # aws_cloudwatch_query_definition.celery-errors[0] will be created
  + resource "aws_cloudwatch_query_definition" "celery-errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/containerinsights/notification-canada-ca-staging-eks-cluster/application",
        ]
      + name                = "Celery errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /^celery/
            | filter @message like /ERROR\/.*Worker/
            | sort @timestamp desc
            | limit 20
        EOT
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
